## 1.파이썬과 MySQL 활용

+ 파이썬과 MySql을 연결해주는 모듈 : mysqlclient, PymySQL
        - pip install mysqlclient
        - pip install PyMySQL

In [101]:
##### mysqlclient 모듈을 이용한 연결 테스트 

import MySQLdb

conn = MySQLdb.connect(host="127.0.0.1", user="root", passwd="1111", database="testdb")
#conn = MySQLdb.connect(host="netsong7.synology.me", user="user2", 
#                       password="Mysqldb12345!", database="user2db", port=3307)
print(conn)
conn.close()

<_mysql.connection open to '127.0.0.1' at 000002B7D6F15BF0>

In [102]:
##### PyMySQL 모듈을 이용한 연결 테스트 

import pymysql

conn = pymysql.connect(host="127.0.0.1", user="root", passwd="1111", database="testdb")
print(conn)
conn.close()

<pymysql.connections.Connection object at 0x000002B7D8CAEE20>

In [103]:
# 바꿀일 있으면 여기서 바꾸면 된다.
config = {"host":"127.0.0.1", "user":"root", "passwd":"1111", "database":"testdb"}

In [104]:
conn = pymysql.connect(**config)
print(conn)
conn.close()

<pymysql.connections.Connection object at 0x000002B7D8C102E0>

# (1) select

In [107]:
conn= MySQLdb.connect(**config)

sql = "select* from emp limit 5"

cur = conn.cursor()
cur.execute(sql)

#print(cur)
#for data in cur:
#    print(data)

for a,b,c,d,e,f,g,h in cur:
    print(a,b,c,d,e,f,g,h)
    
conn.close()


#result = []
#for data in cur:
 #   result.append(data)
    
#conn.close()

print(result)

7369 SMITH CLERK 7902 1980-12-17 00:00:00 800.0 None 20
7499 ALLEN SALESMAN 7698 1981-02-20 00:00:00 1600.0 300.0 30
7521 WARD SALESMAN 7698 1981-02-22 00:00:00 1250.0 500.0 30
7566 JONES MANAGER 7839 1981-04-02 00:00:00 2975.0 None 20
7654 MARTIN SALESMAN 7698 1981-09-28 00:00:00 1250.0 1400.0 30
[(7369, 'SMITH', 'CLERK', 7902, datetime.datetime(1980, 12, 17, 0, 0), 800.0, None, 20), (7499, 'ALLEN', 'SALESMAN', 7698, datetime.datetime(1981, 2, 20, 0, 0), 1600.0, 300.0, 30), (7521, 'WARD', 'SALESMAN', 7698, datetime.datetime(1981, 2, 22, 0, 0), 1250.0, 500.0, 30), (7566, 'JONES', 'MANAGER', 7839, datetime.datetime(1981, 4, 2, 0, 0), 2975.0, None, 20), (7654, 'MARTIN', 'SALESMAN', 7698, datetime.datetime(1981, 9, 28, 0, 0), 1250.0, 1400.0, 30)]

# (2)INSERT

In [120]:
# 에러 안나는 이유 if not exists

sql = """create table if not exists tbltest(
    empno    int,
    ename    varchar(10),
    sal      int,
    job      varchar(10)
)"""


print("------------------------------------------")

conn = MySQLdb.connect(**config)

cur = conn.cursor()
cur.execute(sql)

sql = "insert into tbltest(empno, ename, sal) values(1, 'scott', 5000)"


cur.execute(sql)
conn.commit()

conn.close()


#select * from suppliers;
#select * from tbltest;

------------------------------------------

In [116]:


conn = MySQLdb.connect(**config)
cur = conn.cursor()

sql = "insert into tbltest(empno, ename, sal) values(" \
    + str(empno) + ", '" + ename + "', " + str(sal)+ ")"
    
empno = 2
ename = "miller"
sal = 1400


    
#print(sql)
cur.execute(sql)
conn.commit()

conn.close()

In [117]:


conn = MySQLdb.connect(**config)
cur = conn.cursor()

sql = "insert into tbltest(empno, ename, sal) values(%s, %s, %s)"
sql_data = (str(empno), ename, str(sal))


empno = 3
ename = "tom"
sal = 2000


cur.execute(sql, sql_data)
conn.commit()

conn.close()

In [127]:


try:
    conn = MySQLdb.connect(**config)
    cur = conn.cursor()
    
    sql = "insert into tbltest(empno, ename, sal) values(%s, %s, %s)"
    sql_data = (str(empno), ename, str(sal))

    
    empno = 4
    ename = "jerry"
    sal = 2000
    
    
    cur.execute(sql, sql_data)
    conn.commit()
except Exception as e:
    print("error : ", e)
finally:
    conn.close()

In [122]:
##### 데이터 여러 개 입력하기

conn = MySQLdb.connect(**config)
cur = conn.cursor()

for i in range(10):
    sql = "insert into tbltest(empno, ename, sal) values(5, 'jane', 10000)"
    cur.execute(sql)
    conn.commit()
    
conn.close()

# (3) cursor

1) fetchall(),fetchmany(),fetchon()

+ default는 fetchall

In [123]:

try:
    conn = MySQLdb.connect(**config)
    cur = conn.cursor()
    
    cur.execute("select * from tbltest")
    
    #for i in cur.fetchall():
    #    print(i)
    
    #for i in cur.fetchmany(5):
    #    print(i)
    
    print(cur.fetchone())
        
finally:
    conn.close()

(1, 'scott', 5000, None)

### 2) Dictcursor
    +필드명을 인덱스 대신 키로 사용

In [124]:

try:
    conn = MySQLdb.connect(**config)
    cur = conn.cursor(MySQLdb.cursors.DictCursor)
    
    cur.execute("select * from tbltest")
    
    for i in cur.fetchall():
        # print(i[0], i[1], i[2])
        print(i["empno"], i["ename"], i["sal"])
    
finally:
    conn.close()

1 scott 5000
3 tom 2000
4 jerry 2000
5 jane 10000
5 jane 10000
5 jane 10000
5 jane 10000
5 jane 10000
5 jane 10000
5 jane 10000
5 jane 10000
5 jane 10000
5 jane 10000
3 tom 2000
4 jerry 2000
5 jane 10000
5 jane 10000
5 jane 10000
5 jane 10000
5 jane 10000
5 jane 10000
5 jane 10000
5 jane 10000
5 jane 10000
5 jane 10000
3 tom 2000
4 jerry 2000
5 jane 10000
5 jane 10000
5 jane 10000
5 jane 10000
5 jane 10000
5 jane 10000
5 jane 10000
5 jane 10000
5 jane 10000
5 jane 10000
1 scott 5000
3 tom 2000
4 jerry 2000
2 miller 1300
2 miller 1300
2 miller 1300
3 tom 2000
3 tom 2000
1 scott 5000
2 miller 1400
2 miller 1400
1 scott 5000
2 miller 1400
2 miller 1400
4 jerry 2000
1 scott 5000
4 jerry 2000
5 jane 10000
5 jane 10000
5 jane 10000
5 jane 10000
5 jane 10000
5 jane 10000
5 jane 10000
5 jane 10000
5 jane 10000
5 jane 10000

# 2. 응용 예제

### (1) CSV파일을 DB에 저장

In [82]:
"""
CREATE TABLE IF NOT EXISTS suppliers(
    Supplier_Name    varchar(20),
    Invoice_Number   varchar(20),
    Part_Number      varchar(20),
    Cost             float,
    Purchase_Date    date
);

"""

'\nCREATE TABLE IF NOT EXISTS suppliers(\n    Supplier_Name    varchar(20),\n    Invoice_Number   varchar(20),\n    Part_Number      varchar(20),\n    Cost             float,\n    Purchase_Date    date\n);\n\n'

In [84]:
import csv

file= csv.reader (open("data/input.csv"))
#print(file)

#print(next(file))
#print(next(file))
#print(next(file))
#print(next(file))
#print(next(file))

next(file)

try : 
    conn = MySQLdb.connect(**config)
    cur = conn.cursor()
 
    cur.execute("delete from suppliers")
    conn.commit()


    for row in file:
        #print(row)
        cur.execute("insert into suppliers values(%s, %s, %s, %s, %s)",row)
        
    conn.commit()

finally:
    conn.close()
    
    
    
    
#select * from suppliers;

## (2) DB에서 가져온 데이터를 파일로 저장

In [92]:
try : 
    conn = MySQLdb.connect(**config)
    cur = conn.cursor()
    
    cur.execute("select * from suppliers where cost > 500000")

    #for i in cur:
    #    print(i)
    
    file = csv.writer(open("data/output.csv","w"), delimiter=",")
    #구분해서 저장하겠다.
    
    header = ["Supplier name","Invoice number","part number","cost","purchase date"]
    file.writerow(header)
    
    for row in cur:
        file.writerow(row)
    
finally:
    conn.close()